yandld/enet2can_e31/board/pin_mux.c
    /* PTE2 (pin 147) is disabled */
    const siul2_pin_settings_t BOARD_INITSPIPINS_DEINIT_PTE2 =
    {
        .base                        = SIUL2,
        .pinPortIdx                  = 130u,
        .mux                         = kPORT_MUX_AS_GPIO,
        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
        .driveStrength               = kPORT_DRIVE_STRENTGTH_NOT_AVAILABLE,
        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
        .slewRateCtrlSel             = kPORT_SLEW_RATE_NOT_AVAILABLE,
        .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
        .invert                      = kPORT_INVERT_DISABLED,
        .inputBuffer                 = kPORT_INPUT_BUFFER_DISABLED,
        .outputBuffer                = kPORT_OUTPUT_BUFFER_DISABLED,
        .adcInterleaves              = { kMUX_MODE_NOT_AVAILABLE, kMUX_MODE_NOT_AVAILABLE },
        .inputMuxReg                 = {
                                         165u,
                                         18u,
                                         197u,
                                         231u,
                                         361u,
                                         51u,
                                         88u
                                       },
        .inputMux                    = {
                                         kPORT_INPUT_MUX_ALT0,
                                         kPORT_INPUT_MUX_ALT0,
                                         kPORT_INPUT_MUX_ALT0,
                                         kPORT_INPUT_MUX_ALT0,
                                         kPORT_INPUT_MUX_ALT0,
                                         kPORT_INPUT_MUX_ALT0,
                                         kPORT_INPUT_MUX_ALT0,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT
                                       },
        .initValue                   = 2u
    };
    SIUL2_PinInit(&BOARD_INITSPIPINS_DEINIT_PTE2);

    /* PTE6 (pin 146) is disabled */
    const siul2_pin_settings_t BOARD_INITSPIPINS_DEINIT_PTE6 =
    {
        .base                        = SIUL2,
        .pinPortIdx                  = 134u,
        .mux                         = kPORT_MUX_AS_GPIO,
        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
        .driveStrength               = kPORT_DRIVE_STRENTGTH_NOT_AVAILABLE,
        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
        .slewRateCtrlSel             = kPORT_SLEW_RATE_NOT_AVAILABLE,
        .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
        .invert                      = kPORT_INVERT_DISABLED,
        .inputBuffer                 = kPORT_INPUT_BUFFER_DISABLED,
        .outputBuffer                = kPORT_OUTPUT_BUFFER_DISABLED,
        .adcInterleaves              = { kMUX_MODE_NOT_AVAILABLE, kMUX_MODE_NOT_AVAILABLE },
        .inputMuxReg                 = {
                                         164u,
                                         22u,
                                         223u,
                                         373u,
                                         94u
                                       },
        .inputMux                    = {
                                         kPORT_INPUT_MUX_ALT0,
                                         kPORT_INPUT_MUX_ALT0,
                                         kPORT_INPUT_MUX_ALT0,
                                         kPORT_INPUT_MUX_ALT0,
                                         kPORT_INPUT_MUX_ALT0,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT
                                       },
        .initValue                   = 2u
    };
    SIUL2_PinInit(&BOARD_INITSPIPINS_DEINIT_PTE6);

}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitLCDPins:
- options: {callFromInitBoot: 'false', coreID: core0, enableClock: 'false'}
- pin_list:
  - {pin_num: '141', peripheral: LPI2C_1, signal: SDA, pin_signal: PTC6, direction: INPUT/OUTPUT, pullSelect: pullUp, pullEnable: enabled, padKeepingEnable: enabled,
    outputBufferEnable: enabled}
  - {pin_num: '140', peripheral: LPI2C_1, signal: SCL, pin_signal: PTC7, direction: INPUT/OUTPUT, pullSelect: pullUp, pullEnable: enabled, padKeepingEnable: enabled,
    outputBufferEnable: enabled}
  - {pin_num: '114', peripheral: SIUL2, signal: 'GPIO, 46', pin_signal: PTB14, direction: INPUT, pullEnable: disabled, padKeepingEnable: enabled, outputBufferEnable: enabled}
  - {pin_num: '97', peripheral: SIUL2, signal: 'GPIO, 73', pin_signal: PTC9, direction: INPUT, padKeepingEnable: enabled, outputBufferEnable: enabled}
  - {pin_num: '113', peripheral: SIUL2, signal: 'GPIO, 47', pin_signal: PTB15, direction: INPUT, padKeepingEnable: disabled, outputBufferEnable: enabled}
  - {pin_num: '98', peripheral: SIUL2, signal: 'GPIO, 72', pin_signal: PTC8, direction: INPUT, outputBufferEnable: enabled}
  - {pin_num: '94', peripheral: SIUL2, signal: 'GPIO, 33', pin_signal: PTB1, direction: INPUT, outputBufferEnable: enabled}
  - {pin_num: '90', peripheral: FLEXIO, signal: 'FXIO_D, 15', pin_signal: PTC11, direction: INPUT/OUTPUT, pullEnable: disabled, padKeepingEnable: enabled, outputBufferEnable: enabled}
  - {pin_num: '95', peripheral: FLEXIO, signal: 'FXIO_D, 14', pin_signal: PTB0, direction: INPUT/OUTPUT, pullEnable: disabled, padKeepingEnable: enabled, outputBufferEnable: enabled}
  - {pin_num: '92', peripheral: SIUL2, signal: 'GPIO, 74', pin_signal: PTC10, direction: INPUT/OUTPUT, outputBufferEnable: enabled}
  - {pin_num: '87', peripheral: FLEXIO, signal: 'FXIO_D, 16', pin_signal: PTC23, direction: INPUT/OUTPUT, padKeepingEnable: enabled, outputBufferEnable: enabled}
  - {pin_num: '88', peripheral: FLEXIO, signal: 'FXIO_D, 17', pin_signal: PTC24, direction: INPUT/OUTPUT, padKeepingEnable: enabled, outputBufferEnable: enabled}
  - {pin_num: '89', peripheral: FLEXIO, signal: 'FXIO_D, 18', pin_signal: PTC25, direction: INPUT/OUTPUT, padKeepingEnable: enabled, outputBufferEnable: enabled}
  - {pin_num: '91', peripheral: FLEXIO, signal: 'FXIO_D, 19', pin_signal: PTC26, direction: INPUT/OUTPUT, padKeepingEnable: enabled, outputBufferEnable: enabled}
  - {pin_num: '93', peripheral: FLEXIO, signal: 'FXIO_D, 20', pin_signal: PTC27, direction: INPUT/OUTPUT, padKeepingEnable: enabled, outputBufferEnable: enabled}
  - {pin_num: '96', peripheral: FLEXIO, signal: 'FXIO_D, 21', pin_signal: PTC28, direction: INPUT/OUTPUT, padKeepingEnable: enabled, outputBufferEnable: enabled}
  - {pin_num: '99', peripheral: FLEXIO, signal: 'FXIO_D, 22', pin_signal: PTC29, direction: INPUT/OUTPUT, padKeepingEnable: enabled, outputBufferEnable: enabled}
  - {pin_num: '101', peripheral: FLEXIO, signal: 'FXIO_D, 23', pin_signal: PTC30, direction: INPUT/OUTPUT, padKeepingEnable: enabled, outputBufferEnable: enabled}
  - {pin_num: '103', peripheral: FLEXIO, signal: 'FXIO_D, 24', pin_signal: PTC31, direction: INPUT/OUTPUT, padKeepingEnable: enabled, outputBufferEnable: enabled}
  - {pin_num: '111', peripheral: FLEXIO, signal: 'FXIO_D, 25', pin_signal: PTD20, direction: INPUT/OUTPUT, padKeepingEnable: enabled, outputBufferEnable: enabled}
  - {pin_num: '115', peripheral: FLEXIO, signal: 'FXIO_D, 26', pin_signal: PTD21, direction: INPUT/OUTPUT, padKeepingEnable: enabled, outputBufferEnable: enabled}
  - {pin_num: '118', peripheral: FLEXIO, signal: 'FXIO_D, 27', pin_signal: PTD22, direction: INPUT/OUTPUT, padKeepingEnable: enabled, outputBufferEnable: enabled}
  - {pin_num: '122', peripheral: FLEXIO, signal: 'FXIO_D, 28', pin_signal: PTD23, direction: INPUT/OUTPUT, padKeepingEnable: enabled, outputBufferEnable: enabled}
  - {pin_num: '125', peripheral: FLEXIO, signal: 'FXIO_D, 29', pin_signal: PTD24, direction: INPUT/OUTPUT, padKeepingEnable: enabled, outputBufferEnable: enabled}
  - {pin_num: '131', peripheral: FLEXIO, signal: 'FXIO_D, 30', pin_signal: PTD26, direction: INPUT/OUTPUT, padKeepingEnable: enabled, outputBufferEnable: enabled}
  - {pin_num: '132', peripheral: FLEXIO, signal: 'FXIO_D, 31', pin_signal: PTD27, direction: INPUT/OUTPUT, padKeepingEnable: enabled, outputBufferEnable: enabled}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

